Tekla Open API Reference for Tekla Structures 2025
GridBase.FontColor Property
 Gets or sets font color for the grid labels
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Color FontColor { get; set; }
Public Property FontColor As Color
	Get
	Set
Property Value
Type: Color
See Also
Reference
GridBase Class
Tekla.Structures.Model Namespace